Repository: redomino/redomino.tabsandslides
Catalog: redomino/tabsandslides/locales/*/LC_MESSAGES/redomino.tabsandslides.po
Languages: it

source: A portlet that displays a content with a specific view
it: Un portlet che mostra un contenuto con una vista specifica

source: A portlet that displays the content of a folder with a specific view
it: Un portlet che mostra il contenuto di una cartella con una vista specifica

source: A portlet that displays the results of a collection with a specific view
it: Un portlet che mostra il contenuto di una cartella con una vista specifica

source: Add a Content Portlet
it: Aggiungi un portlet Contenuto

source: Add a Folder Portlet
it: Aggiungi una portlet relativa alla cartella corrente

source: All Items
it: Tutti gli elementi

source: Content Id
it: Id del contenuto

source: Context content type
it: Tipo di contenuto del contesto

source: Edit Content Portlet
it: Modifica il portlet Contenuto

source: Edit Folder Portlet
it: Modifica una portlet relativa alla cartella corrente

source: For example: python:object.portal_type == 'News Item'
it: Per esempio: python:object.portal_type == 'News Item'

source: Gallery with preview (Image bottom)
it: Gallery con anteprima (Immagine sotto)

source: Gallery with preview (Image top)
it: Gallery con anteprima (Immagine sopra)

source: If you use this option, the portlet picks the content relative to the closest parent of the specified content type. If not, the content is relative to the current object.
it: Se si utilizza questa opzione, il portlet prenderà il contenuto relativo al contenuto padre più vicino del tipo specificato. Altrimenti, il contenuto sarà relativo all'oggetto corrente

source: List
it: Lista

source: Pick the content type you want to add to this portlet. If you choose a folderish content the portlet show the elements inside. If you choose a collection the portlet shows the objects that fit the criteria.
it: Seleziona il tipo di contenuto da aggiungere a questa portlet.

source: TabsAndSlides Collection portlet
it: TabsAndSlides: Portlet Collezione

source: TabsAndSlides Content portlet
it: TabsAndSlides: Portlet Contenuto

source: TabsAndSlides Folder portlet
it: TabsAndSlides: Portlet Cartella

source: TabsAndSlides TalExp portlet
it: TabsAndSlides: Portlet TALExp

source: Tal expression
it: Espressione TAL

source: Tal expression description
it: Questa espressione TAL può ritornare una lista di brain o oggetti. Per esempio:- categorie: python:portal.portal_catalog.searchResults(Subject=object.Subject())- percorso: python:portal.portal_catalog.searchResults(path='/'.join(object.getPhysicalPath()))- path example2: python:portal.portal_catalog.searchResults(path={query='/'.join(object.getPhysicalPath(), depth = 1}))- type example: python: portal.portal_catalog.searchResults(Type='Document')- sort example: portal.portal_catalog.searchResults(sort_order='reverse', sort_limit = 5, sort_on='Date')- contenuti correlati: python: context.getRelatedItems()- backreference contenuti correlati: python: [ b.getSourceObject() for b in portal.reference_catalog.getBackReferences(object, relationship='relatesTo')]

source: The id of the content.
it: L'id del contenuto

source: This portlet display items from the current Folder.
it: Questo portlet mostra gli elementi nella cartella corrente.

source: This portlet display one item or all items inside a folder.
it: Questo portlet mostra uno o più elementi dentro ad una cartella.

source: Which content type
it: Quale tipo di contenuto
